text = '''1. 四川省广元市朝天核桃中国特色农产品优势区

2. 辽宁省大连市大连海参中国特色农产品优势区

3. 山西省临猗县临猗苹果中国特色农产品优势区

4. 黑龙江省齐齐哈尔市梅里斯达斡尔族区梅里斯洋葱中国特色农产品优势区

5. 辽宁省大连市大连大樱桃中国特色农产品优势区

6. 四川省通江县通江银耳中国特色农产品优势区

7. 四川省凉山州凉山桑蚕茧中国特色农产品优势区

8. 山西省大同市云州区大同黄花中国特色农产品优势区

9. 山东省肥城市肥城桃中国特色农产品优势区

10. 云南省勐海县勐海普洱茶中国特色农产品优势区

11. 安徽省六安市六安瓜片中国特色农产品优势区

12. 贵州省湄潭县湄潭翠芽中国特色农产品优势区

13. 河北省兴隆县兴隆山楂中国特色农产品优势区

14. 安徽省宁国市宁国山核桃中国特色农产品优势区

15. 广东省清远市清远鸡中国特色农产品优势区

16. 广西壮族自治区恭城瑶族自治县恭城月柿中国特色农产品优势区

17. 河北省隆化县隆化肉牛中国特色农产品优势区

18. 湖南省衡阳市衡阳油茶中国特色农产品优势区

19. 广西壮族自治区苍梧县六堡茶中国特色农产品优势区

20. 山西省隰县隰县玉露香梨中国特色农产品优势区

21. 吉林省通化县通化蓝莓中国特色农产品优势区

22. 湖北省赤壁市赤壁青砖茶中国特色农产品优势区

23. 吉林省集安市集安人参中国特色农产品优势区

24. 湖北省通城县黄袍山油茶中国特色农产品优势区

25. 河南省西峡县西峡猕猴桃中国特色农产品优势区

26. 广西壮族自治区容县容县沙田柚中国特色农产品优势区

27. 山东省胶州市胶州大白菜中国特色农产品优势区

28. 山西省安泽县安泽连翘中国特色农产品优势区

29. 广西壮族自治区田阳县百色番茄中国特色农产品优势区

30. 陕西省眉县眉县猕猴桃中国特色农产品优势区

31. 浙江省庆元县、龙泉市、景宁畲族自治县庆元香菇中国特色农产品优势区

32. 重庆市永川区永川秀芽中国特色农产品优势区

33. 河北省巨鹿县巨鹿金银花中国特色农产品优势区

34. 江苏省兴化市兴化香葱中国特色农产品优势区

35. 广西壮族自治区全州县全州禾花鱼中国特色农产品优势区

36. 四川省宜宾市宜宾早茶中国特色农产品优势区

37. 陕西省紫阳县紫阳富硒茶中国特色农产品优势区

38. 湖北省蕲春县蕲艾中国特色农产品优势区

39. 江西省上饶市广丰区广丰马家柚中国特色农产品优势区

40. 湖北省洪湖市洪湖水生蔬菜中国特色农产品优势区

41. 江苏省无锡市惠山区阳山水蜜桃中国特色农产品优势区

42. 浙江省磐安县磐五味中药材中国特色农产品优势区

43. 重庆市万州区万州玫瑰香橙中国特色农产品优势区

44. 辽宁省铁岭市铁岭榛子中国特色农产品优势区

45. 广东省德庆县德庆贡柑中国特色农产品优势区

46. 贵州省麻江县麻江蓝莓中国特色农产品优势区

47. 福建省平和县平和蜜柚中国特色农产品优势区

48. 内蒙古自治区呼伦贝尔市呼伦贝尔草原羊中国特色农产品优势区

49. 山东省烟台市烟台苹果中国特色农产品优势区

50. 内蒙古自治区乌海市乌海葡萄中国特色农产品优势区

51. 广东省广州市从化区、增城区广州荔枝中国特色农产品优势区

52. 贵州省威宁彝族回族苗族自治县威宁洋芋中国特色农产品优势区

53. 江西省广昌县广昌白莲中国特色农产品优势区

54. 内蒙古自治区阿拉善左旗阿拉善白绒山羊中国特色农产品优势区

55. 浙江省常山县常山油茶中国特色农产品优势区

56. 安徽省滁州市南谯区、琅琊区滁菊中国特色农产品优势区

57. 广东农垦湛江菠萝中国特色农产品优势区

58. 宁夏回族自治区盐池县盐池黄花菜中国特色农产品优势区

59. 青海省共和县龙羊峡三文鱼中国特色农产品优势区

60. 河北省深州市深州蜜桃中国特色农产品优势区

61. 新疆生产建设兵团第五师双河葡萄中国特色农产品优势区

62. 江苏省溧阳市溧阳青虾中国特色农产品优势区

63. 江苏省宝应县宝应荷藕中国特色农产品优势区

64. 贵州省盘州市盘州刺梨中国特色农产品优势区

65. 黑龙江省讷河市讷河马铃薯中国特色农产品优势区

66. 上海市嘉定区马陆葡萄中国特色农产品优势区

67. 甘肃省陇南市武都区武都花椒中国特色农产品优势区

68. 北京市怀柔区怀柔板栗中国特色农产品优势区

69. 河南省焦作市怀药中国特色农产品优势区

70. 陕西省商洛市商洛香菇中国特色农产品优势区

71. 陕西省韩城市韩城花椒中国特色农产品优势区

72. 福建省安溪县安溪铁观音中国特色农产品优势区

73. 黑龙江省伊春市伊春黑木耳中国特色农产品优势区

74. 吉林省前郭县查干湖淡水有机鱼中国特色农产品优势区

75. 山东省夏津县夏津椹果中国特色农产品优势区

76. 黑龙江省虎林市虎林椴树蜜中国特色农产品优势区

77. 天津市西青区沙窝萝卜中国特色农产品优势区

78. 福建省连江县连江鲍鱼中国特色农产品优势区

79. 长白山森工集团有限公司长白山桑黄中国特色农产品优势区

80. 青海省祁连县祁连藏羊中国特色农产品优势区

81. 新疆维吾尔自治区英吉沙县英吉沙杏中国特色农产品优势区

82. 西藏自治区亚东县亚东鲑鱼中国特色农产品优势区

83.海南省东方市东方火龙果中国特色农产品优势区'''.split('\n')
coo ='''
1.	湖北省随州市随州香菇中国特色农产品优势区
2.	河北省怀来县怀来葡萄中国特色农产品优势区
3.	吉林省洮南市洮南绿豆中国特色农产品优势区
4.	河北省内丘县富岗苹果中国特色农产品优势区
5.	四川省资中县资中血橙中国特色农产品优势区
6.	四川省广安市广安区广安龙安柚中国特色农产品优势区
7.	山西省沁县沁州黄小米中国特色农产品优势区
8.	山东省寿光市寿光蔬菜中国特色农产品优势区
9.	安徽省黄山市黄山区太平猴魁中国特色农产品优势区
10.	广西壮族自治区融安县融安金桔中国特色农产品优势区
11.	山东省沂源县沂源苹果中国特色农产品优势区
12.	湖北省十堰市武当道茶中国特色农产品优势区
13.	重庆市石柱县石柱黄连中国特色农产品优势区
14.	山西省忻州市忻州杂粮中国特色农产品优势区
15.	山东省烟台市福山区福山大樱桃中国特色农产品优势区
16.	浙江省杭州市临安区临安山核桃中国特色农产品优势区
17.	广西壮族自治区玉林市玉州区玉林三黄鸡中国特色农产品优势区
18.	宁夏回族自治区中卫市中卫香山硒砂瓜中国特色农产品优势区
19.	江苏省东台市东台西瓜中国特色农产品优势区
20.	四川省眉山市眉山晚橘中国特色农产品优势区
21.	云南省漾濞县漾濞核桃中国特色农产品优势区
22.	辽宁省鞍山市鞍山南果梨中国特色农产品优势区
23.	广西壮族自治区河池市宜州区宜州桑蚕茧中国特色农产品优势区
24.	重庆市江津区江津花椒中国特色农产品优势区
25.	陕西省大荔县大荔冬枣中国特色农产品优势区
26.	甘肃省榆中县兰州高原夏菜中国特色农产品优势区
27.	河北省安国市安国中药材中国特色农产品优势区
28.	湖北省宜昌市宜昌蜜桔中国特色农产品优势区
29.	福建省福鼎市福鼎白茶中国特色农产品优势区
30.	海南省三亚市三亚芒果中国特色农产品优势区
31.	宁夏回族自治区灵武市灵武长枣中国特色农产品优势区
32.	河北省涉县涉县核桃中国特色农产品优势区
33.	广西壮族自治区钦州市钦南区钦州大蚝中国特色农产品优势区
34.	广东省仁化县仁化贡柑中国特色农产品优势区
35.	四川省合江县合江荔枝中国特色农产品优势区
36.	山东省滨州市沾化区沾化冬枣中国特色农产品优势区
37.	辽宁省盘山县盘山河蟹中国特色农产品优势区
38.	安徽省砀山县砀山酥梨中国特色农产品优势区
39.	福建省宁德市蕉城区宁德大黄鱼中国特色农产品优势区
40.	云南省文山州文山三七中国特色农产品优势区
41.	河北省晋州市晋州鸭梨中国特色农产品优势区
42.	宁夏回族自治区西吉县西吉马铃薯中国特色农产品优势区
43.	湖南省湘潭县湘潭湘莲中国特色农产品优势区
44.	内蒙古自治区乌兰察布市乌兰察布马铃薯中国特色农产品优势区
45.	山东省汶上县汶上芦花鸡中国特色农产品优势区
46.	广西壮族自治区平南县平南石硖龙眼中国特色农产品优势区
47.	新疆维吾尔自治区叶城县叶城核桃中国特色农产品优势区
48.	安徽省霍山县霍山石斛中国特色农产品优势区
49.	重庆市潼南区潼南柠檬中国特色农产品优势区
50.	山西省吉县吉县苹果中国特色农产品优势区
51.	广东农垦湛江剑麻中国特色农产品优势区
52.	贵州省织金县织金竹荪中国特色农产品优势区
53.	江苏省苏州市吴中区洞庭山碧螺春中国特色农产品优势区
54.	湖南省汝城县汝城朝天椒中国特色农产品优势区
55.	甘肃省静宁县静宁苹果中国特色农产品优势区
56.	云南省华坪县华坪芒果中国特色农产品优势区
57.	甘肃省岷县岷县当归中国特色农产品优势区
58.	浙江省余姚市余姚榨菜中国特色农产品优势区
59.	四川省安岳县安岳柠檬中国特色农产品优势区
60.	江西省婺源县婺源绿茶中国特色农产品优势区
61.	重庆市巫山县巫山脆李中国特色农产品优势区
62.	河南省杞县杞县大蒜中国特色农产品优势区
63.	江苏省南京市高淳区固城湖螃蟹中国特色农产品优势区
64.	河南省泌阳县泌阳夏南牛中国特色农产品优势区
65.	广东省潮州市潮州单丛茶中国特色农产品优势区
66.	云南省腾冲市槟榔江水牛中国特色农产品优势区
67.	云南省宾川县宾川柑橘中国特色农产品优势区
68.	内蒙古自治区赤峰市赤峰小米中国特色农产品优势区
69.	江苏省海门市海门山羊中国特色农产品优势区
70.	贵州省都匀市都匀毛尖中国特色农产品优势区
71.	青海省海西蒙古族藏族自治州柴达木枸杞中国特色农产品优势区
72.	天津市宝坻区宝坻黄板泥鳅中国特色农产品优势区
73.	内蒙古自治区通辽市科尔沁牛中国特色农产品优势区
74.	新疆生产建设兵团第一师阿拉尔市阿拉尔红枣中国特色农产品优势区
75.	新疆维吾尔自治区若羌县若羌红枣中国特色农产品优势区
76.	江西省崇仁县崇仁麻鸡中国特色农产品优势区
77.	内蒙古自治区鄂托克旗阿尔巴斯绒山羊中国特色农产品优势区
78.	河南省平舆县平舆白芝麻中国特色农产品优势区
79.	上海市崇明区崇明清水蟹中国特色农产品优势区
80.	新疆维吾尔自治区鄯善县吐鲁番葡萄中国特色农产品优势区
81.	陕西省富平县富平奶山羊中国特色农产品优势区
82.	西藏自治区工布江达县藏猪中国特色农产品优势区
83.	黑龙江省东宁市东宁黑木耳中国特色农产品优势区
84.	西藏自治区类乌齐县牦牛中国特色农产品优势区

'''.split('\n')
txt ='''
    1. 浙江省安吉县安吉白茶中国特色农产品优势区

　　2. 重庆市涪陵区涪陵青菜头中国特色农产品优势区

　　3.河北省平泉市平泉香菇中国特色农产品优势区

　　4.重庆市荣昌区荣昌猪中国特色农产品优势区

　　5.福建省建瓯市建瓯笋竹中国特色农产品优势区

　　6.浙江省三门县三门青蟹中国特色农产品优势区

　　7.河南省信阳市信阳毛尖中国特色农产品优势区

　　8.福建省武夷山市武夷岩茶中国特色农产品优势区

　　9.宁夏回族自治区盐池县盐池滩羊中国特色农产品优势区

　　10.安徽省亳州市亳州中药材中国特色农产品优势区

　　11.湖北省恩施州恩施硒茶中国特色农产品优势区

　　12.贵州省兴仁县兴仁薏仁米中国特色农产品优势区

　　13.江西省南丰县南丰蜜桔中国特色农产品优势区

　　14.江西省赣州市赣南脐橙中国特色农产品优势区

　　15.山东省东阿县东阿黑毛驴中国特色农产品优势区

　　16.湖南省安化县安化黑茶中国特色农产品优势区

　　17.河北省鸡泽县鸡泽辣椒中国特色农产品优势区

　　18.广西壮族自治区陆川县陆川猪中国特色农产品优势区

　　19.湖南省邵阳县邵阳油茶中国特色农产品优势区

　　20.江苏省盱眙县盱眙小龙虾中国特色农产品优势区

　　21.湖北省武汉市蔡甸区蔡甸莲藕中国特色农产品优势区

　　22.湖北省潜江市潜江小龙虾中国特色农产品优势区

　　23.山东省昌邑市昌邑生姜中国特色农产品优势区

　　24.江苏省邳州市邳州银杏中国特色农产品优势区

　　25.江苏省昆山市阳澄湖大闸蟹中国特色农产品优势区

　　26.云南省临沧市临沧普洱茶中国特色农产品优势区

　　27.浙江省绍兴市柯桥区、诸暨市、嵊州市嵊州香榧中国特色农产品优势区

　　28.广东省珠海市斗门区白蕉海鲈中国特色农产品优势区

　　29.广西壮族自治区田东县田东芒果中国特色农产品优势区

　　30.云南省元谋县元谋蔬菜中国特色农产品优势区

　　31.贵州省遵义市遵义朝天椒中国特色农产品优势区

　　32.山东省金乡县金乡大蒜中国特色农产品优势区

　　33.重庆市奉节县奉节脐橙中国特色农产品优势区

　　34.山东省济南市章丘区章丘大葱中国特色农产品优势区

　　35.四川省苍溪县苍溪猕猴桃中国特色农产品优势区

　　36.内蒙古自治区杭锦后旗河套向日葵中国特色农产品优势区

　　37.吉林省汪清县汪清黑木耳中国特色农产品优势区

　　38.陕西省商洛市商洛核桃中国特色农产品优势区

　　39.四川省攀枝花市攀枝花芒果中国特色农产品优势区

　　40.山西省长治市上党中药材中国特色农产品优势区

　　41.吉林省抚松县抚松人参中国特色农产品优势区

　　42.河南省灵宝市灵宝苹果中国特色农产品优势区

　　43.广西壮族自治区永福县永福罗汉果中国特色农产品优势区

　　44.云南省德宏州德宏小粒咖啡中国特色农产品优势区

　　45.四川省宜宾县宜宾油樟中国特色农产品优势区

　　46.河北省迁西县迁西板栗中国特色农产品优势区

　　47.北京市平谷区平谷大桃中国特色农产品优势区

　　48.湖南省华容县华容芥菜中国特色农产品优势区

　　49.宁夏回族自治区中宁县中宁枸杞中国特色农产品优势区

　　50.黑龙江省海伦市海伦大豆中国特色农产品优势区

　　51.甘肃省定西市安定区定西马铃薯中国特色农产品优势区

　　52.内蒙古自治区锡林郭勒盟锡林郭勒草原肉羊中国特色农产品优势区

　　53.辽宁省北镇市北镇葡萄中国特色农产品优势区

　　54.陕西省洛川市洛川苹果中国特色农产品优势区

　　55.海南省澄迈县桥头地瓜中国特色农产品优势区

　　56.新疆维吾尔自治区巴音郭楞州库尔勒香梨中国特色农产品优势区

　　57.上海市浦东新区南汇水蜜桃中国特色农产品优势区

　　58.新疆维吾尔自治区吐鲁番市高昌区吐鲁番哈密瓜中国特色农产品优势区

　　59.新疆生产建设兵团第一师3团阿拉尔薄皮核桃中国特色农产品优势区

　　60.西藏自治区日喀则市青稞中国特色农产品优势区

　　61.青海省玉树州玉树牦牛中国特色农产品优势区

　　62.大兴安岭林业集团加格达奇林业局大兴安岭黑山猪中国特色农产品优势区

'''.split('\n')
text += coo
co =[]
for sheng in text:
    co.append(sheng[3:7].strip())
for sheng in txt:
    co.append(sheng[4:9].strip())
co.sort()
out =[]
for i in co:
    if i != '':
        out.append(i.strip('.')[:2])
counts = {}
for word in out:
    counts[word] = counts.get(word,0) + 1
items = list(counts.items())
items.sort(key = lambda x:x[1],reverse=True)
print(items)